cmsis-svd/cmsis-svd/data/Infineon/s6e2g2xh.svd
        <!-- REGISTER "TX1024TOMAXOCTETS_GB" -->
        <register>
          <name>TX1024TOMAXOCTETS_GB</name>
          <description>Number of good and bad frames transmitted with length between 1024 and Maxsize (inclusive) bytes, exclusive of preamble and retried frames</description>
          <addressOffset>0x138</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <!-- REGISTER "TXUNICASTFRAMES_GB" -->
        <register>
          <name>TXUNICASTFRAMES_GB</name>
          <description>Number of good and bad unicast frames transmitted</description>
          <addressOffset>0x13C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <!-- REGISTER "TXMULTICASTFRAMES_GB" -->
        <register>
          <name>TXMULTICASTFRAMES_GB</name>
          <description>Number of good and bad multicast frames transmitted</description>
          <addressOffset>0x140</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <!-- REGISTER "TXBROADCASTFRAMES_GB" -->
        <register>
          <name>TXBROADCASTFRAMES_GB</name>
          <description>Number of good and bad broadcast frames transmitted</description>
          <addressOffset>0x144</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <!-- REGISTER "TXUNDERFLOWERROR" -->
        <register>
          <name>TXUNDERFLOWERROR</name>
          <description>Number of frames aborted due to frame underflow error</description>
          <addressOffset>0x148</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <!-- REGISTER "TXSINGLECOL_G" -->
        <register>
          <name>TXSINGLECOL_G</name>
          <description>Number of successfully transmitted frames after a single collision in Half-duplex mode </description>
          <addressOffset>0x14C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <!-- REGISTER "TXMULTICOL_G" -->
        <register>
          <name>TXMULTICOL_G</name>
          <description>Number of successfully transmitted frames after more than a single collision in Half-duplex mode</description>
          <addressOffset>0x150</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <!-- REGISTER "TXDEFERRED" -->
        <register>
          <name>TXDEFERRED</name>
          <description>Number of successfully transmitted frames after a deferral in Half-duplex mode.</description>
          <addressOffset>0x154</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <!-- REGISTER "TXLATECOL" -->
        <register>
          <name>TXLATECOL</name>
          <description>Number of frames aborted due to late collision error. </description>
          <addressOffset>0x158</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <!-- REGISTER "TXEXESSCOL" -->
        <register>
          <name>TXEXESSCOL</name>
          <description>Number of frames aborted due to excessive (16) collision errors. </description>
          <addressOffset>0x15C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <!-- REGISTER "TXCARRIERERROR" -->
        <register>
          <name>TXCARRIERERROR</name>
          <description>Number of frames aborted due to carrier sense error (no carrier or loss of carrier).  </description>
          <addressOffset>0x160</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <!-- REGISTER "TXOCTETCOUNT_G" -->
        <register>
          <name>TXOCTETCOUNT_G</name>
          <description>Number of bytes transmitted, exclusive of preamble, in good frames only. </description>
          <addressOffset>0x164</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <!-- REGISTER "TXFRAMECOUNT_G" -->
        <register>
          <name>TXFRAMECOUNT_G</name>
          <description>Number of good frames transmitted. </description>
          <addressOffset>0x168</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <!-- REGISTER "TXEXECESSDEF_G" -->
        <register>
          <name>TXEXECESSDEF_G</name>
          <description>Number of frames aborted due to excessive deferral error (deferred for more than two max-sized frame times).</description>
          <addressOffset>0x16C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <!-- REGISTER "TXPAUSEFRAMES" -->
        <register>
          <name>TXPAUSEFRAMES</name>
          <description>Number of good PAUSE frames transmitted. </description>
          <addressOffset>0x170</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
