cmsis-svd/cmsis-svd/data/Infineon/s6e2g2xh.svd
        <!-- REGISTER "EPFR33" -->
        <register>
          <name>EPFR33</name>
          <description>Extended Pin Function Setting Regster 33</description>
          <addressOffset>0x684</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0FFF0FFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "CLK1E" -->
            <field>
              <name>CLK1E</name>
              <description>IC1_CLK Oputput Select bits</description>
              <msb>27</msb>
              <lsb>26</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "VCC1E" -->
            <field>
              <name>VCC1E</name>
              <description>IC1_VCC Output Select bits</description>
              <msb>25</msb>
              <lsb>24</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "VPEN1E" -->
            <field>
              <name>VPEN1E</name>
              <description>IC1_VPEN Output Select bits</description>
              <msb>23</msb>
              <lsb>22</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "RST1E" -->
            <field>
              <name>RST1E</name>
              <description>IC1_RST Output Select bits</description>
              <msb>21</msb>
              <lsb>20</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "DATA1B" -->
            <field>
              <name>DATA1B</name>
              <description>IC1_DATA Input/Output Select bits</description>
              <msb>19</msb>
              <lsb>18</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CIN1S" -->
            <field>
              <name>CIN1S</name>
              <description>IC1_CIN Input Select bits</description>
              <msb>17</msb>
              <lsb>16</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CLK0E" -->
            <field>
              <name>CLK0E</name>
              <description>IC0_CLK Output Select bits</description>
              <msb>11</msb>
              <lsb>10</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "VCC0E" -->
            <field>
              <name>VCC0E</name>
              <description>IC0_VCC Output Select bits</description>
              <msb>9</msb>
              <lsb>8</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "VPEN0E" -->
            <field>
              <name>VPEN0E</name>
              <description>IC0_VPEN Output Select bits</description>
              <msb>7</msb>
              <lsb>6</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "RST0E" -->
            <field>
              <name>RST0E</name>
              <description>IC0_RST Output Select bits</description>
              <msb>5</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "DATA0B" -->
            <field>
              <name>DATA0B</name>
              <description>IC0_DATA Input/Output Select bits</description>
              <msb>3</msb>
              <lsb>2</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CIN0S" -->
            <field>
              <name>CIN0S</name>
              <description>IC0_CIN Input Select bits</description>
              <msb>1</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "EPFR35" -->
        <register>
          <name>EPFR35</name>
          <description>Extended Pin Function Setting Regster 35</description>
          <addressOffset>0x68C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0FFF0000</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "SDO1E" -->
            <field>
              <name>SDO1E</name>
              <description>MI2SDO1 Output Select bits</description>
              <msb>27</msb>
              <lsb>26</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SDI1S" -->
            <field>
              <name>SDI1S</name>
              <description>MI2SDI1 Input Select bits</description>
              <msb>25</msb>
              <lsb>24</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "WS1B" -->
            <field>
              <name>WS1B</name>
              <description>MI2SWS1 Output Select bits</description>
              <msb>23</msb>
              <lsb>22</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SCK1B" -->
            <field>
              <name>SCK1B</name>
              <description>MI2SCK1 Output Select bits</description>
              <msb>21</msb>
              <lsb>20</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "MCK1E" -->
            <field>
              <name>MCK1E</name>
              <description>MI2SMCK1 Output Select bits</description>
              <msb>19</msb>
              <lsb>18</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "MCK1S" -->
            <field>
              <name>MCK1S</name>
              <description>MI2SMCK1 Input Select bits</description>
              <msb>17</msb>
              <lsb>16</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
